{
  "config": {
    "step": {
      "init": {
        "description": "This integration requires that the Xcel Itron Smart Meter be connected to your network. This integration will attempt to help you connect your device to your network if you have not yet done so.\n\nIf your meter is already connected to your network, you can skip the setup.",
        "data": {
          "smart_meter_on_network": "Your smart meter is already on your network.",
          "smart_meter_not_on_network": "Your smart meter is not yet on your network.",
          "smart_meter_network_choice": "Is your smart meter on your network?"
        }
      },
      "not_on_network": {
        "description": "For detailed instructions on how to add your Smart Meter to your network see https://github.com/tvories/hass_xcel_itron/\nThe integration has generated a certificate and key for authenticating to your device. You need the LFDI shown below in order to [add your device to Xcel's device management page](https://my.xcelenergy.com/MyAccount/). Select Add a Device, paste in the below LFDI, give your device a nickname, use \"Itron\" as the Manufacturer, and set \"Type\" to \"Other\". It will take some time for Xcel to add your device to their system. You should receive an email when it's complete, and you can continue the integration here once the device is on your network.\n\n\n Your generated LFDI:\n\n```\n{lfdi}\n```\n\nCopy this LFDI for the Xcel Managed Devices page in your account.\n\nYour genrated Certificate (This will be stored in the directory you specify, but you can copy it if you want for your own records):\n\n```\n{certificate}\n```\n\nYour generated Key (This will be stored in the directory you specify, but you can copy it if you want for your own records):\n\n```\n{key}\n```\n\nYou can also customize the directory where the cert and key are stored.\n",
        "data": {
          "now_on_network_choice": "My device is now on my network.",
          "waiting_on_xcel_choice": "I'm waiting for Xcel to add my device to their system.",
          "cert_dir": "Directory to store cert and key:"
        }
      },
      "on_network": {
        "description": "If your Xcel Itron Smart Meter is already on your network, you will need the certificate and key that is linked to the LFDI you used to join the meter to your Xcel account. If you used this integration to generate the certificate and key, then the form should have auto-filled the values in the below text fields. If you already had a certificate and key generated outside of this integration, you will need to paste in the contents of the certificate and key here.",
        "data" : {
          "device_name": "Device Name",
          "host": "[%key:common::config_flow::data::host%]",
          "port": "[%key:common::config_flow::data::port%]",
          "certificate": "Certificate",
          "key": "Key"
        }
      },
      "waiting_on_xcel": {
        "description": "You should receive an email when Xcel has added your device to their system. Once you receive that email, your device should be on the network and you can start this wizard over again. Discovery may also work and prompt you to configure your device once it's discoverd on the network."
      }
    },
    "error": {
      "cannot_connect": "[%key:common::config_flow::error::cannot_connect%]",
      "invalid_auth": "[%key:common::config_flow::error::invalid_auth%]",
      "unknown": "[%key:common::config_flow::error::unknown%]"
    },
    "abort": {
      "already_configured": "[%key:common::config_flow::abort::already_configured_device%]",
      "waiting_on_xcel": "You should receive an email when Xcel has added your device to their system. Once you receive that email, your device should be on the network and you can start this wizard over again. Discovery may also work and prompt you to configure your device once it's discoverd on the network.",
      "on_network": "Aborting but for a good reason! We haven't written the connection yet."
    }
  }
}
